# Подвиг 2. На вход программе подается слово в виде строки.
# Необходимо прочитать это слово и его первую букву сделать заглавной,
# а остальные - малыми. Результат отобразить на экране.
# Sample Input:
# HELLO
# Sample Output:
# Hello
_str = input()
print(_str.title())