# Подвиг 8. Объявите в программе следующий список из названий городов:
#
# cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
# Затем, необходимо объявить генератор, который бы используя этот список, выдавал 1 000 000 наименований городов по циклу. То есть, дойдя до конца списка, возвращался в начало и повторял перебор. И так, для выдачи миллиона названий. Вывести на экран первые 20 наименований городов с помощью генератора в одну строчку через пробел.
cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
gen = (x for x in (cities * 1000000))
for _ in range(20):
    print(next(gen), end = ' ')


# cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
# n = len(cities)
# gen = (cities[i % n] for i in range(1_000_000))
# print(*(next(gen) for i in range(20)))


# cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
# res = (j for i in range(0, 1000000) for j in cities)
# print(*list(res)[:20])

# cities = ["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]
# gen = (cities[i % len(cities)] for i in range(1_000_001))
# print(*(next(gen) for _ in range(20)))

# gen = (__import__('itertools').cycle(["Москва", "Ульяновск", "Самара", "Уфа", "Омск", "Тула"]))
# print(*(next(gen) for _ in range(20)))

