# Подвиг 5. На вход программе подается строка. Прочитайте эту строку и отобразите первые четыре ее символа. Полагается, что строка гарантированно имеет длину не менее четырех символов.

# Sample Input:
# panda
# Sample Output:
# pand
#In
_str = input()
print(_str[:4])