# Подвиг 6. На вход программе подается строка. Прочитайте эту строку и отобразите последние три ее символа. Полагается, что строка гарантированно имеет длину не менее трех символов.
#
# Sample Input:
# Balakirev
# Sample Output:
# rev
_str = input()
print(_str[-3:])