letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']

# Создаём словарь с ключами из символов и значениями азбуки Морзе
d =  dict(zip(letters, morse))
message = input().upper()
# Перебираем сообщение, сравнивая с ключами в словаре
res = []
for char in message:
    if char in d:
        res.append(d[char])
print(*res)



