# Подвиг 5. На вход программе подается двумерный список размерностью 5 х 5 элементов, состоящий из целых чисел (пример см. ниже). В программе уже реализовано их чтение и сохранение в списке:
#
# s = sys.stdin.readlines()
# lst_in = [list(map(int, x.strip().split())) for x in s]
# Необходимо проверить, является ли этот двумерный список симметричным относительно главной диагонали. Главная диагональ — та, которая идёт из левого верхнего угла двумерного массива в правый нижний. Выведите на экран "ДА", если матрица (таблица чисел) симметрична и "НЕТ" в противном случае.
#
# Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/5/5.6.5
#
# Sample Input:
#
# 2 3 4 5 6
# 3 2 7 8 9
# 4 7 2 0 4
# 5 8 0 2 1
# 6 9 4 1 2
# Sample Output:
#
# ДА

import sys
# считывание списка из входного потока
s = sys.stdin.readlines()
lst_in = [list(map(int, x.strip().split())) for x in s]
flag = True

# lst_in = [[2, 3, 4, 5, 6], # для отладки программы, чтобы каждый раз не вводить матрицу.
#           [3, 2, 7, 8, 9], # значения матрицы для проверки меняем вручную.
#           [4, 7, 0, 0, 4],
#           [5, 8, 0, 2, 1],
#           [6, 9, 4, 1, 2]]

# Проверка матрицы на квадратность
for x in lst_in:
    if len(x) == len(lst_in):
        flag = True
    else:
        flag = False
        print('Введённая матрица не является квадратной!')
        break

# Проверка на равенство элементов главной диагонали
if flag:
    for k in range(len(lst_in)-1):
        if lst_in[k][k] == lst_in[k + 1][k + 1]:
            flag = True
        else:
            print('Введённая матрица не является симметричной, так как элементы главной диагонали не равны')
            flag = False
            break
# Проверка элементов матрицы вне главной диагонали на симметричность матрицы
if flag:
    for i in range(len(lst_in)):
        if flag:
            for j in range(len(lst_in)):
                if lst_in[i][j] == lst_in[j][i]:
                    flag = True
                else:
                    flag = False
                    break
        else:
            flag = False
            break
if flag:
    print('ДА')
else:
    print('НЕТ')