choices = [input().lower(), input().lower()]
flag = 'Тимур'
match choices:
    case ['бумага', 'бумага'] | ['камень', 'камень'] | ['ножницы', 'ножницы'] | ['ящерица', 'ящерица'] | ['спок', \
                                                                                                          'спок']:
        flag = 'ничья'
    case ['камень', 'ножницы'] | ['ножницы', 'бумага'] | ['бумага', 'камень'] | ['камень', 'ящерица'] | ['ящерица', \
                                                                                                         'спок'] | [ \
             'спок', 'ножницы'] | ['ножницы', 'ящерица'] | ['ящерица', 'бумага'] | ['бумага', 'спок'] | ['спок', \
                                                                                                         'камень']:
        pass
    case _:
        flag = 'Руслан'
print(flag)


# options = ["камень", "ящерица", "Спок", "ножницы", "бумага"]
# results = ["ничья", "Руслан", "Тимур", "Руслан", "Тимур"]
#
# timur_move = input()
# ruslan_move = input()
#
# case = options.index(timur_move) - options.index(ruslan_move)
# res = results[case]
#
# print(res)

# g = ('ножницы', 'бумага', 'камень', 'ящерица', 'Спок')
# dist = (g.index(input()) - g.index(input())) % len(g)
# print(('ничья', 'Тимур', 'Руслан')[dist and dist % 2 + 1])